BM_I85B78/CFD/0/impParticleForces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      impParticleForces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

internalField   nonuniform List<vector> 
463
(
(4.84933e-05 -2.95251e-08 8.37649e-08)
(4.84414e-05 -3.0005e-08 8.67919e-08)
(4.82481e-05 -3.17925e-08 9.80689e-08)
(4.79679e-05 -3.43806e-08 1.14467e-07)
(4.76829e-05 -3.69917e-08 1.3224e-07)
(4.75051e-05 -3.85833e-08 1.45159e-07)
(4.7278e-05 -4.05865e-08 1.6317e-07)
(4.70835e-05 -4.22598e-08 1.80629e-07)
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           uniform (4.85065e-05 -2.9403e-08 8.29949e-08);
    }
    wall_top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    front1
    {
        type            cyclic;
    }
    back1
    {
        type            cyclic;
    }
    left1
    {
        type            cyclic;
    }
    right1
    {
        type            cyclic;
    }
    front2
    {
        type            cyclic;
    }
    back2
    {
        type            cyclic;
    }
    left2
    {
        type            cyclic;
    }
    right2
    {
        type            cyclic;
    }
    front3
    {
        type            cyclic;
    }
    back3
    {
        type            cyclic;
    }
    left3
    {
        type            cyclic;
    }
    right3
    {
        type            cyclic;
    }
}


// ************************************************************************* //
